benchmarks/1-social-network/workload_test/home.log
Running 1m test @ http://10.0.0.5:31499/wrk2-api/home-timeline/read
  4 threads and 8 connections
  Thread calibration: mean lat.: 2.689ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 2.620ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 2.461ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.557ms, rate sampling interval: 11ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.51ms    1.76ms   6.53ms   75.14%
    Req/Sec    15.40     38.89   181.00     85.35%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.48ms
 75.000%    4.27ms
 90.000%    5.09ms
 99.000%    6.53ms
 99.900%    9.82ms
 99.990%   14.07ms
 99.999%   14.07ms
100.000%   14.07ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.759     0.000000            1         1.00
       1.033     0.100000          298         1.11
       1.131     0.200000          591         1.25
       1.240     0.300000          884         1.43
       1.335     0.400000         1180         1.67
       1.480     0.500000         1473         2.00
       1.600     0.550000         1621         2.22
       1.788     0.600000         1767         2.50
       2.637     0.650000         1914         2.86
       3.841     0.700000         2061         3.33
       4.267     0.750000         2210         4.00
       4.419     0.775000         2282         4.44
       4.551     0.800000         2356         5.00
       4.703     0.825000         2431         5.71
       4.835     0.850000         2510         6.67
       4.943     0.875000         2577         8.00
       4.987     0.887500         2614         8.89
       5.091     0.900000         2652        10.00
       5.167     0.912500         2688        11.43
       5.267     0.925000         2724        13.33
       5.391     0.937500         2761        16.00
       5.495     0.943750         2779        17.78
       5.567     0.950000         2797        20.00
       5.687     0.956250         2816        22.86
       5.795     0.962500         2834        26.67
       5.899     0.968750         2852        32.00
       5.955     0.971875         2863        35.56
       6.007     0.975000         2872        40.00
       6.083     0.978125         2880        45.71
       6.191     0.981250         2889        53.33
       6.263     0.984375         2899        64.00
       6.287     0.985938         2904        71.11
       6.327     0.987500         2908        80.00
       6.423     0.989062         2912        91.43
       6.587     0.990625         2917       106.67
       6.779     0.992188         2921       128.00
       6.947     0.992969         2924       142.22
       7.107     0.993750         2926       160.00
       7.259     0.994531         2928       182.86
       7.903     0.995313         2931       213.33
       7.983     0.996094         2933       256.00
       8.075     0.996484         2934       284.44
       8.143     0.996875         2935       320.00
       8.231     0.997266         2936       365.71
       8.999     0.997656         2938       426.67
       9.063     0.998047         2939       512.00
       9.063     0.998242         2939       568.89
       9.743     0.998437         2940       640.00
       9.743     0.998633         2940       731.43
       9.823     0.998828         2941       853.33
      10.623     0.999023         2942      1024.00
      10.623     0.999121         2942      1137.78
      10.623     0.999219         2942      1280.00
      10.623     0.999316         2942      1462.86
      12.535     0.999414         2943      1706.67
      12.535     0.999512         2943      2048.00
      12.535     0.999561         2943      2275.56
      12.535     0.999609         2943      2560.00
      12.535     0.999658         2943      2925.71
      14.071     0.999707         2944      3413.33
      14.071     1.000000         2944          inf
#[Mean    =        2.514, StdDeviation   =        1.755]
#[Max     =       14.064, Total count    =         2944]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3594 requests in 1.00m, 15.03MB read
Requests/sec:     59.90
Transfer/sec:    256.45KB