benchmarks/1-social-network/workload_test/user.log
Running 1m test @ http://10.107.206.4:8080/wrk2-api/user-timeline/read
  4 threads and 8 connections
  Thread calibration: mean lat.: 33.132ms, rate sampling interval: 89ms
  Thread calibration: mean lat.: 34.717ms, rate sampling interval: 105ms
  Thread calibration: mean lat.: 30.213ms, rate sampling interval: 88ms
  Thread calibration: mean lat.: 31.421ms, rate sampling interval: 88ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    25.02ms    7.48ms  46.91ms   76.51%
    Req/Sec     6.77      8.40    34.00     86.45%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   25.20ms
 75.000%   28.25ms
 90.000%   33.22ms
 99.000%   46.91ms
 99.900%   60.64ms
 99.990%   62.43ms
 99.999%   62.43ms
100.000%   62.43ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       5.895     0.000000            1         1.00
      16.591     0.100000          140         1.11
      19.919     0.200000          279         1.25
      22.191     0.300000          417         1.43
      23.983     0.400000          557         1.67
      25.199     0.500000          694         2.00
      25.743     0.550000          764         2.22
      26.351     0.600000          835         2.50
      26.847     0.650000          903         2.86
      27.471     0.700000          972         3.33
      28.255     0.750000         1041         4.00
      28.735     0.775000         1077         4.44
      29.359     0.800000         1112         5.00
      30.111     0.825000         1146         5.71
      30.927     0.850000         1180         6.67
      31.775     0.875000         1215         8.00
      32.447     0.887500         1232         8.89
      33.247     0.900000         1252        10.00
      34.047     0.912500         1267        11.43
      34.815     0.925000         1285        13.33
      35.967     0.937500         1302        16.00
      36.287     0.943750         1310        17.78
      37.119     0.950000         1319        20.00
      38.431     0.956250         1328        22.86
      39.359     0.962500         1336        26.67
      40.735     0.968750         1345        32.00
      41.663     0.971875         1349        35.56
      42.367     0.975000         1354        40.00
      42.943     0.978125         1358        45.71
      43.711     0.981250         1362        53.33
      44.767     0.984375         1367        64.00
      45.791     0.985938         1369        71.11
      46.335     0.987500         1371        80.00
      46.687     0.989062         1373        91.43
      47.807     0.990625         1375       106.67
      50.015     0.992188         1378       128.00
      50.047     0.992969         1379       142.22
      52.831     0.993750         1380       160.00
      53.151     0.994531         1381       182.86
      53.823     0.995313         1382       213.33
      54.047     0.996094         1383       256.00
      56.895     0.996484         1384       284.44
      56.895     0.996875         1384       320.00
      59.263     0.997266         1385       365.71
      59.263     0.997656         1385       426.67
      60.639     0.998047         1387       512.00
      60.639     0.998242         1387       568.89
      60.639     0.998437         1387       640.00
      60.639     0.998633         1387       731.43
      60.639     0.998828         1387       853.33
      60.639     0.999023         1387      1024.00
      60.639     0.999121         1387      1137.78
      60.639     0.999219         1387      1280.00
      62.431     0.999316         1388      1462.86
      62.431     1.000000         1388          inf
#[Mean    =       25.018, StdDeviation   =        7.479]
#[Max     =       62.400, Total count    =         1388]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1695 requests in 1.00m, 21.84MB read
  Socket errors: connect 0, read 0, write 0, timeout 1
Requests/sec:     28.25
Transfer/sec:    372.76KB