benchmarks/1-social-network/workload_test/user.log
Running 1m test @ http://10.0.0.5:31499/wrk2-api/user-timeline/read
  4 threads and 8 connections
  Thread calibration: mean lat.: 6.771ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 7.182ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 7.726ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 7.405ms, rate sampling interval: 18ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     6.98ms    1.69ms  12.18ms   82.06%
    Req/Sec     7.08     20.43    66.00     88.66%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.11ms
 75.000%    7.80ms
 90.000%    8.49ms
 99.000%   12.18ms
 99.900%   16.96ms
 99.990%   24.32ms
 99.999%   24.32ms
100.000%   24.32ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.521     0.000000            1         1.00
       5.267     0.100000          139         1.11
       6.107     0.200000          278         1.25
       6.475     0.300000          420         1.43
       6.847     0.400000          556         1.67
       7.115     0.500000          694         2.00
       7.255     0.550000          765         2.22
       7.395     0.600000          833         2.50
       7.531     0.650000          907         2.86
       7.667     0.700000          973         3.33
       7.799     0.750000         1043         4.00
       7.871     0.775000         1078         4.44
       7.967     0.800000         1112         5.00
       8.067     0.825000         1147         5.71
       8.175     0.850000         1181         6.67
       8.335     0.875000         1216         8.00
       8.415     0.887500         1234         8.89
       8.503     0.900000         1250        10.00
       8.591     0.912500         1267        11.43
       8.695     0.925000         1284        13.33
       8.927     0.937500         1304        16.00
       8.959     0.943750         1310        17.78
       9.071     0.950000         1319        20.00
       9.191     0.956250         1328        22.86
       9.343     0.962500         1336        26.67
       9.543     0.968750         1345        32.00
       9.695     0.971875         1349        35.56
       9.919     0.975000         1354        40.00
      10.007     0.978125         1358        45.71
      10.263     0.981250         1362        53.33
      10.679     0.984375         1367        64.00
      10.895     0.985938         1369        71.11
      11.135     0.987500         1371        80.00
      11.663     0.989062         1373        91.43
      12.215     0.990625         1375       106.67
      12.839     0.992188         1378       128.00
      12.871     0.992969         1379       142.22
      12.903     0.993750         1380       160.00
      13.103     0.994531         1381       182.86
      13.287     0.995313         1382       213.33
      13.407     0.996094         1383       256.00
      13.599     0.996484         1384       284.44
      13.599     0.996875         1384       320.00
      14.679     0.997266         1385       365.71
      14.679     0.997656         1385       426.67
      15.095     0.998047         1386       512.00
      15.095     0.998242         1386       568.89
      15.095     0.998437         1386       640.00
      16.959     0.998633         1387       731.43
      16.959     0.998828         1387       853.33
      16.959     0.999023         1387      1024.00
      16.959     0.999121         1387      1137.78
      16.959     0.999219         1387      1280.00
      24.319     0.999316         1388      1462.86
      24.319     1.000000         1388          inf
#[Mean    =        6.984, StdDeviation   =        1.692]
#[Max     =       24.304, Total count    =         1388]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1695 requests in 1.00m, 21.60MB read
  Socket errors: connect 0, read 0, write 0, timeout 1
Requests/sec:     28.25
Transfer/sec:    368.67KB